In [1]:
#Tablular Data Preprocessing

In [2]:
import numpy as np
import pandas as pd
import seaborn as sns
import matplotlib.pyplot as plt

In [3]:
df = pd.read_csv('Data.csv')

In [4]:
df.shape

(10030, 8)

In [5]:
df.describe

<bound method NDFrame.describe of                  Name  Age Date_of_Birth  Gender Marital_Status    BMI  \
0          John Smith   25    1999-03-15    Male         Single  24.50
1       Sarah Johnson   28    1996-07-22  Female        Married  22.80
2       Michael Brown   22    2002-01-10    Male         Single  26.30
3         Emily Davis   24    2000-05-30  Female         Single  21.70
4        David Wilson   30    1993-11-05    Male        Married  29.10
...               ...  ...           ...     ...            ...    ...
10025   John Thompson  114    1909-02-26       m              s  33.97
10026        Kim Ruiz  102    1921-06-14  female         single  43.10
10027      Scott Paul  115    1908-09-09       m        married  38.15
10028    Timothy Rice   87    1936-07-27       m              M  12.91
10029  Roberto Huerta   10    2013-08-01    Male              M  22.24

       Practicing_Hours_2024_Jan_to_Aug Dietary_Preference
0                                   300         Vegetarian
1                                   250     Non-Vegetarian
2                                   320     Non-Vegetarian
3                                   280         Vegetarian
4                                   280     Non-Vegetarian
...                                 ...                ...
10025                               300                 nv
10026                               306         Vegetarian
10027                                54                  v
10028                               484                veg
10029                                42                veg

[10030 rows x 8 columns]>

In [6]:
# df.describe()

In [7]:
df.head()

,Name,Age,Date_of_Birth,Gender,Marital_Status,BMI,Practicing_Hours_2024_Jan_to_Aug,Dietary_Preference
0,John Smith,25,1999-03-15,Male,Single,24.5,300,Vegetarian
1,Sarah Johnson,28,1996-07-22,Female,Married,22.8,250,Non-Vegetarian
2,Michael Brown,22,2002-01-10,Male,Single,26.3,320,Non-Vegetarian
3,Emily Davis,24,2000-05-30,Female,Single,21.7,280,Vegetarian
4,David Wilson,30,1993-11-05,Male,Married,29.1,280,Non-Vegetarian

In [8]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10030 entries, 0 to 10029
Data columns (total 8 columns):
 #   Column                            Non-Null Count  Dtype
---  ------                            --------------  -----
 0   Name                              10030 non-null  object
 1   Age                               10030 non-null  int64
 2   Date_of_Birth                     10030 non-null  object
 3   Gender                            10030 non-null  object
 4   Marital_Status                    10030 non-null  object
 5   BMI                               10030 non-null  float64
 6   Practicing_Hours_2024_Jan_to_Aug  10030 non-null  int64
 7   Dietary_Preference                10030 non-null  object
dtypes: float64(1), int64(2), object(5)
memory usage: 627.0+ KB

In [10]:
df.isnull().sum()

Name                                0
Age                                 0
Date_of_Birth                       0
Gender                              0
Marital_Status                      0
BMI                                 0
Practicing_Hours_2024_Jan_to_Aug    0
Dietary_Preference                  0
dtype: int64

In [11]:
df.isna().sum()
#df.dropna()

Name                                0
Age                                 0
Date_of_Birth                       0
Gender                              0
Marital_Status                      0
BMI                                 0
Practicing_Hours_2024_Jan_to_Aug    0
Dietary_Preference                  0
dtype: int64

In [12]:
df.duplicated().sum()

0

In [13]:
df['Gender'].unique()

array(['Male', 'Female', 'male', 'F', 'female', 'm'], dtype=object)

In [14]:
values_to_replace = ['male', 'm']
df['Gender'] = df['Gender'].replace(values_to_replace, 'Male')

values_to_replace = ['F', 'female']
df['Gender'] = df['Gender'].replace(values_to_replace, 'Female')

In [15]:
df

,Name,Age,Date_of_Birth,Gender,Marital_Status,BMI,Practicing_Hours_2024_Jan_to_Aug,Dietary_Preference
0,John Smith,25,1999-03-15,Male,Single,24.50,300,Vegetarian
1,Sarah Johnson,28,1996-07-22,Female,Married,22.80,250,Non-Vegetarian
2,Michael Brown,22,2002-01-10,Male,Single,26.30,320,Non-Vegetarian
3,Emily Davis,24,2000-05-30,Female,Single,21.70,280,Vegetarian
4,David Wilson,30,1993-11-05,Male,Married,29.10,280,Non-Vegetarian
...,...,...,...,...,...,...,...,...
10025,John Thompson,114,1909-02-26,Male,s,33.97,300,nv
10026,Kim Ruiz,102,1921-06-14,Female,single,43.10,306,Vegetarian
10027,Scott Paul,115,1908-09-09,Male,married,38.15,54,v
10028,Timothy Rice,87,1936-07-27,Male,M,12.91,484,veg
10029,Roberto Huerta,10,2013-08-01,Male,M,22.24,42,veg

In [16]:
df['Marital_Status'].unique()

array(['Single', 'Married', 's', 'married', 'single', 'M'], dtype=object)

In [17]:
values_to_replace = ['s', 'single']
df['Marital_Status'] = df['Marital_Status'].replace(values_to_replace, 'Single')

values_to_replace = ['married', 'M']
df['Marital_Status'] = df['Marital_Status'].replace(values_to_replace, 'Married')

In [18]:
df

,Name,Age,Date_of_Birth,Gender,Marital_Status,BMI,Practicing_Hours_2024_Jan_to_Aug,Dietary_Preference
0,John Smith,25,1999-03-15,Male,Single,24.50,300,Vegetarian
1,Sarah Johnson,28,1996-07-22,Female,Married,22.80,250,Non-Vegetarian
2,Michael Brown,22,2002-01-10,Male,Single,26.30,320,Non-Vegetarian
3,Emily Davis,24,2000-05-30,Female,Single,21.70,280,Vegetarian
4,David Wilson,30,1993-11-05,Male,Married,29.10,280,Non-Vegetarian
...,...,...,...,...,...,...,...,...
10025,John Thompson,114,1909-02-26,Male,Single,33.97,300,nv
10026,Kim Ruiz,102,1921-06-14,Female,Single,43.10,306,Vegetarian
10027,Scott Paul,115,1908-09-09,Male,Married,38.15,54,v
10028,Timothy Rice,87,1936-07-27,Male,Married,12.91,484,veg
10029,Roberto Huerta,10,2013-08-01,Male,Married,22.24,42,veg

In [19]:
df['Dietary_Preference'].unique()

array(['Vegetarian', 'Non-Vegetarian', 'non-veg', 'nonveg',
       'Non Vegetarian', 'nv', 'veg', 'v'], dtype=object)

In [20]:
values_to_replace = ['veg', 'v']
df['Dietary_Preference'] = df['Dietary_Preference'].replace(values_to_replace, 'Vegetarian')

values_to_replace = ['non-veg', 'nonveg', 'Non Vegetarian', 'nv']
df['Dietary_Preference'] = df['Dietary_Preference'].replace(values_to_replace, 'Non-Vegetarian')

In [21]:
df

,Name,Age,Date_of_Birth,Gender,Marital_Status,BMI,Practicing_Hours_2024_Jan_to_Aug,Dietary_Preference
0,John Smith,25,1999-03-15,Male,Single,24.50,300,Vegetarian
1,Sarah Johnson,28,1996-07-22,Female,Married,22.80,250,Non-Vegetarian
2,Michael Brown,22,2002-01-10,Male,Single,26.30,320,Non-Vegetarian
3,Emily Davis,24,2000-05-30,Female,Single,21.70,280,Vegetarian
4,David Wilson,30,1993-11-05,Male,Married,29.10,280,Non-Vegetarian
...,...,...,...,...,...,...,...,...
10025,John Thompson,114,1909-02-26,Male,Single,33.97,300,Non-Vegetarian
10026,Kim Ruiz,102,1921-06-14,Female,Single,43.10,306,Vegetarian
10027,Scott Paul,115,1908-09-09,Male,Married,38.15,54,Vegetarian
10028,Timothy Rice,87,1936-07-27,Male,Married,12.91,484,Vegetarian
10029,Roberto Huerta,10,2013-08-01,Male,Married,22.24,42,Vegetarian

In [22]:
(df['Age']<0).sum()

1067

In [23]:
df = df[df['Age'] >= 0]
df.shape

(8963, 8)

In [24]:
# df = df.loc[df['Age'] > 0]
# df.reset_index(drop=True, inplace=True)

In [25]:
df['Name'].nunique()

8436

In [29]:
duplicate_rows = df[df.duplicated(subset=['Name'])]
print("Duplicate Rows based on 'Name':")
print(duplicate_rows)

Duplicate Rows based on 'Name':
                   Name  Age Date_of_Birth  Gender Marital_Status    BMI  \
361        James Garcia   99    1924-07-07  Female         Single  33.16
519     Stephanie Jones   38    1985-04-29  Female         Single  36.87
609         Jamie Jones   59    1964-07-05  Female        Married  10.22
676       Michael Davis   37    1986-04-29    Male        Married  27.46
856         Brian Smith   82    1941-07-14  Female         Single  12.39
...                 ...  ...           ...     ...            ...    ...
9915      Thomas Thomas   45    1978-09-30    Male         Single  21.87
9925      Melissa Brown   45    1914-02-25  Female         Single  33.91
9943       Steven Smith   38    1985-11-21    Male         Single  24.15
9961   Raymond Sullivan   77    1946-05-24  Female        Married  39.33
10025     John Thompson  114    1909-02-26    Male         Single  33.97

       Practicing_Hours_2024_Jan_to_Aug Dietary_Preference
361                                 315     Non-Vegetarian
519                                 405     Non-Vegetarian
609                                 455     Non-Vegetarian
676                                 401         Vegetarian
856                                 404     Non-Vegetarian
...                                 ...                ...
9915                                 99         Vegetarian
9925                                458     Non-Vegetarian
9943                                383     Non-Vegetarian
9961                                213         Vegetarian
10025                               300     Non-Vegetarian

[527 rows x 8 columns]

In [31]:
(df['Name']=='James Garcia').sum()

2

In [32]:
df[df['Name']=='James Garcia']

,Name,Age,Date_of_Birth,Gender,Marital_Status,BMI,Practicing_Hours_2024_Jan_to_Aug,Dietary_Preference
6,James Garcia,29,1995-04-03,Male,Married,27.00,310,Vegetarian
361,James Garcia,99,1924-07-07,Female,Single,33.16,315,Non-Vegetarian

In [36]:
df['Date_of_Birth'].head()

0    1999-03-15
1    1996-07-22
2    2002-01-10
3    2000-05-30
4    1993-11-05
Name: Date_of_Birth, dtype: object

In [39]:
import warnings
warnings.filterwarnings("ignore")

In [40]:
df['Date_of_Birth'] = pd.to_datetime(df['Date_of_Birth'])

In [41]:
df['Date_of_Birth'].head()

0   1999-03-15
1   1996-07-22
2   2002-01-10
3   2000-05-30
4   1993-11-05
Name: Date_of_Birth, dtype: datetime64[ns]

In [42]:
df['Date_of_Birth'].dt.month.unique()

array([ 3,  7,  1,  5, 11,  9,  4,  2,  6, 12,  8, 10], dtype=int64)

In [43]:
df['Date_of_Birth'].dt.day.nunique()

31

In [44]:
df

,Name,Age,Date_of_Birth,Gender,Marital_Status,BMI,Practicing_Hours_2024_Jan_to_Aug,Dietary_Preference
0,John Smith,25,1999-03-15,Male,Single,24.50,300,Vegetarian
1,Sarah Johnson,28,1996-07-22,Female,Married,22.80,250,Non-Vegetarian
2,Michael Brown,22,2002-01-10,Male,Single,26.30,320,Non-Vegetarian
3,Emily Davis,24,2000-05-30,Female,Single,21.70,280,Vegetarian
4,David Wilson,30,1993-11-05,Male,Married,29.10,280,Non-Vegetarian
...,...,...,...,...,...,...,...,...
10025,John Thompson,114,1909-02-26,Male,Single,33.97,300,Non-Vegetarian
10026,Kim Ruiz,102,1921-06-14,Female,Single,43.10,306,Vegetarian
10027,Scott Paul,115,1908-09-09,Male,Married,38.15,54,Vegetarian
10028,Timothy Rice,87,1936-07-27,Male,Married,12.91,484,Vegetarian
10029,Roberto Huerta,10,2013-08-01,Male,Married,22.24,42,Vegetarian